Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One explained, “in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened Buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཅིག་གི་བུ་མོ་ཐབས་སྔ་མ་ཁོ་ན་ལྟར་རབ་ཏུ་བྱུང་ནས་དེའི་ཁྱིམ་ཐབ་ཀྱིས་ཀྱང་དེ་ཁོ་ན་ལས་བརྟེན་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས།
en: there was a certain householder’s daughter in Vārāṇasī who had fled home life in just the same way, and whose betrothed, entrusting himself to her completely, likewise went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དགེ་སློང་མ་དེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་དེ་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “That nun practiced pure conduct all her life, and at the time of her death, she prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While I may not have attained any great virtues, still I practiced pure conduct all my life.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་ཐབས་འདི་ཁོ་ན་བཞིན་དུ་བག་མར་སོང་བའི་འོག་ཏུ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Therefore, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha. After fleeing from marriage by this very same method, may I go forth in his doctrine alone, cast away all afflictive emotions, and manifest arhatship.’

source: དེ་ནས་དེ་སྔོན་གྱི་ཁྱིམ་ཐབ་ཀྱིས་མཐོང་ནས་དྲིས་པ་བཟང་མོ་ཁྱོད་ཀྱིས་སྨོན་ལམ་ཇི་ལྟ་བུ་ཞིག་བཏབ། དེ་ནས་དེས་དེ་ལ་ཐམས་ཅད་རྒྱས་པར་བསྙད་དོ། །
en: “When he saw her praying, the man to whom she had been betrothed asked, ‘Fine woman, what kind of prayers are you making?’ She explained them in detail,

source: དེ་ནས་དགེ་སློང་དེས་ཀྱང་སྨོན་ལམ་བཏབ་སྟེ།
en: and after hearing her explanation, he prayed in the same way, and said,

source: བཟང་མོ་ཇི་ལྟར་ཁྱོད་ལས་བརྟེན་ནས་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་པ་དེ་བཞིན་དུ་དེ་ཁོ་ནའི་ཚེ་ཡང་ང་ཉིད་ཁྱོད་ཀྱི་ཁྱིམ་ཐབ་ཏུ་གྱུར་ཏེ་
en: ‘Fine woman, having entrusted myself to you completely I found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: ཁྱོད་ཁོ་ན་ལས་བརྟེན་ནས་ བདག་གིས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: When I am again to become your husband, then having entrusted myself to you completely may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དགེ་སློང་དག་དེ་ཇི་སྙམ་དུ་སེམས།
en: “O monks, what do you think?

source: དེའི་ཚེ་དགེ་སློང་མར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་མ་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that nun then is none other than this nun.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: At that time she practiced the holy life all her life, and at the time of her death she prayed,

source: འདི་ལྟར་བདག་བག་མར་སོང་བའི་འོག་ཏུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While I may not have attained any great virtues, still I fled from marriage, went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, and practiced pure conduct all my life.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་བདག་ད་ལྟ་བཞིན་དུ་བག་མར་སོང་བའི་འོག་ཏུ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: Therefore, may I once again flee from marriage, go forth in the doctrine of Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha, cast away all afflictive emotions, and manifest arhatship.’

source: ད་ལྟར་འདི་བག་མར་སོང་བའི་འོག་ཏུ་རབ་ཏུ་བྱུང་ནས་འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that by fleeing marriage and going forth she has pleased me, not displeased me, cast away all afflictive emotions, and manifested arhatship.

source: དེའི་ཚེ་ཁྱིམ་ཐབ་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་འདི་ཉིད་ཡིན་ཏེ།
en: “The one who was betrothed to her then is none other than this monk.

source: དེའི་ཚེ་ང་ཉིད་ཁྱོད་ཀྱི་ཁྱིམ་ཐབ་ཏུ་གྱུར་ནས་ཁྱོད་ཁོ་ན་ལས་བརྟེན་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག་མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘When I again become your husband, entrusting myself to you completely may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: ད་ལྟར་འདིས་འདི་ཁོ་ན་ལ་བརྟེན་ནས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: “So it is that he has now trusted in her completely, pleased me, not displeased me, gone forth in my very doctrine alone, and manifested arhatship.”

source: བག་མ་གཏོང་བ་ཕྱི་མ་ནི།
en: The Second “Betrothal of the Bride” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་བློན་པོའི་གཙོ་བོ་གཉིས་ཡོད་པ་ལ་གཅིག་གི་མིང་ནི་རི་དགས་འཛིན་ཅེས་བྱ། གཅིག་གི་མིང་ནི་བྱིན་པ་ཞེས་བྱའོ། །
en: When the Blessed One was in Śrāvastī, King Prasenajit had two chief ministers there named Mṛgāra and Dinna.

source: དེ་གཉིས་མཛའ་ཞིང་བཤེས་ལ་གཅུགས་པར་གྱུར་ཏེ།
en: The two ministers were very close friends.

source: དེ་གཉིས་ཀྱིས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་གཉིས་ཆུང་མ་དང་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the time came for them to marry each minister took a wife and enjoyed himself with her and coupled.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་གཉིས་ལྷན་ཅིག་ཏུ་ཚོགས་ཏེ་སྨྲས་པ།
en: One day when the two saw each other again, Dinna said,

source: གྲོགས་པོ་བདག་ཅག་གཉིས་ཀྱིས་ཅི་ནས་མཛའ་བ་འདི་ལས་ཇི་སྲིད་འཚོའི་བར་དུ་ཅུང་ཟད་ཀྱང་འབྱེ་བར་མི་བྱའོ་ཞེས་སྨྲས་སོ། །
en: “My friend, we should make it so that come what may, our friendship is not severed, nor even a little strained, for as long as we live.”

source: དེ་ནས་རི་དགས་འཛིན་གྱིས་སྨྲས་པ། འོ་ན་བདག་ཅག་གཉིས་ཀྱིས་ཇི་ལྟར་བྱ།
en: “How could we do that?” asked Mṛgāra.

source: བྱིན་པས་སྨྲས་པ། གཉེན་དུ་བྱའོ། །
en: “We have to become kin,” replied Dinna.

source: རི་དགས་འཛིན་གྱིས་སྨྲས་པ། ཁྱོད་ལ་བུ་ཁྱེའུའམ་བུ་མོ་ལྟ་ཡོད་དམ།
en: “Do you have a son or daughter?” wondered Mṛgāra.

source: བྱིན་པས་སྨྲས་པ་མེད་དོ། །
en: “No, I don’t,” said Dinna.

source: རི་དགས་འཛིན་གྱིས་སྨྲས་པ། འོ་ན་བདག་ལ་བུ་ཁྱེའུ་ཡང་མེད་བུ་མོ་ཡང་མེད་ལ། ཁྱོད་ལ་ཡང་བུ་ཁྱེའུ་ཡང་མེད་བུ་མོ་ཡང་མེད་ན་བདག་ཅག་གཉིས་གཉེན་དུ་ཇི་ལྟར་བྱ།
en: “Well, if you don’t have a son or daughter, and neither do I, how will we ever be kin?” asked Mṛgāra.

source: བྱིན་པས་སྨྲས་པ་གཉེན་དུ་བྱ་བ་ལ་རྣམ་པ་གཉིས་ཡོད་དེ།
en: “There are two ways to become related to someone,” said Dinna,

source: བདག་ཅག་གཉིས་ལ་བུ་ཁྱེའུ་ཡང་མེད་བུ་མོ་ཡང་མེད་མོད་ཀྱི་ད་དུང་མ་སྐྱེས་པའི་གཉེན་བྱར་རུང་སྟེ།
en: Even though neither one of us has children, we could become kin through the children we’ve yet to have.

source: གལ་ཏེ་བདག་གི་བུ་ཁྱེའུ་བཙས་ལ། ཁྱོད་ཀྱི་བུ་མོ་བཙས་ན་ནི་དེ་བདག་གི་བུ་ལ་བྱིན་ཅིག །
en: Say, for instance, I have a son and you have a daughter—then we betroth your daughter to my son.

source: དེ་སྟེ་ཁྱོད་ཀྱི་བུ་ཁྱེའུ་བཙས་ལ་བདག་གི་བུ་མོ་བཙས་ན་ནི་བདག་གིས་དེ་ཁྱོད་ཀྱི་བུ་ལ་སྦྱིན་པར་བྱའོ་ཞེས་བྱས་སོ། །
en: Or say you have a son and I have a daughter—then we betroth my daughter to your son.”

source: དེ་ནས་དེ་ལྟར་བྱའོ་ཞེས་སྨྲས་ནས་དེ་གཉིས་སོང་ངོ་། །
en: They agreed to do just that and went their separate ways.

source: དེ་ནས་ཕྱི་ཞིག་ན་རི་དགས་འཛིན་གྱི་ཆུང་མ་ལ་བུ་ཆགས་པར་གྱུར་ནས།
en: One day, Mṛgāra’s wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་ཁྱེའུ་ཞིག་བཙས་ཏེ། དེའི་མིང་ས་ག་ཞེས་བཏགས་སོ། །
en: After nine or ten months had passed, she gave birth to a child, and they named him Viśākha.

source: འདོད་པ་རྣམས་ནི་ཚ་ཆུ་དང་འདྲ་སྟེ་ཇི་ཙམ་དུ་བསྟེན་པ་དེ་ཙམ་དུ་ཕྱིར་ཞིང་སྐྱེ་བར་འགྱུར་ཏེ།
en: Now desires are like salt water—the more you use to slake your thirst, the more you need.

source: སྔ་ཕྱིར་དེའི་བུ་བདུན་བྱུང་ནས་དེ་རྣམས་ཀྱི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ་རིགས་དང་འཐུན་པར་མིང་བཏགས་ནས་བསྐྱེད་བསྲིངས་སོ། །
en: Altogether Mṛgāra and his wife had seven children, and at the elaborate feasts celebrating their births they named them according to their clan, and began to rear them.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྱིན་པའི་ཆུང་མ་ལ་ཡང་བུ་ཆགས་པར་གྱུར་ནས་
en: Then one day Dinna’s wife also conceived,

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ན
en: and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: བུ་མོ་དེ་རང་བཞིན་གྱིས་ངུ་བར་གྱུར་ནས་ཕ་མ་གཉིས་ཀྱིས་དེ་ཐབས་ཅིས་ཀྱང་དགག་པར་མ་ནུས་སོ། །
en: But it was the child’s nature to weep constantly, and though her parents made every effort, they could not make her stop.

source: དེ་ནས་ཕྱི་ཞིག་ན་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ཁྱིམ་དེར་སོང་ནས་ཁྱིམ་བདག་དེ་ལ་ཆོས་བཤད་པ་དང་
en: This went on until one day Mahā­prajāpatī Gautamī came to their house and taught the Dharma to the householders.

source: བུ་མོ་དེ་ཡང་ཆོས་ཐོས་ནས་ཁ་རོག་སྟེ་འདུག་གོ། །
en: When the child heard the Dharma, she quieted down.

source: དེ་ནས་གང་གི་ཚེ་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་ཁྱིམ་བདག་དེ་ལ་ཆོས་བཤད་ནས་ཕྱིར་སོང་བ་དེའི་ཚེ་ཡང་བུ་མོ་དེ་ངུ་བ་ལ་ཞུགས་པ་དང་།
en: But when Mahā­prajāpatī Gautamī left, having completed her discourse on the Dharma, the child began to weep again.

source: ཁྱིམ་བདག་དེས་འཕྲིགས་ཏེ་བསམས་པ། བུ་མོ་འདི་ནི་ཆོས་ཉན་པ་འདོད་པ་ཞིག་ཡིན་གོར་མ་ཆག་སྙམ་མོ། །
en: The householders realized that the child must have wanted to hear more Dharma.

source: དེ་ནས་དེའི་བཙས་སྟོན་བྱས་ནས་བུ་མོ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ་བུ་མོ་འདི་ཆོས་འདོད་ལ་བྱིན་པའི་བུ་མོ་ཡིན་པས་ན། བུ་མོ་འདིའི་མིང་ཆོས་བྱིན་མ་ཞེས་བྱ་བར་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: At the elaborate feast celebrating her birth they asked, “What name should we give this child?” And they named her, saying, “Since she is Dinna’s child and wishes for Dharma, her name will be Dharmadinnā.”

source: དེ་ནས་བུ་མོ་ཆོས་བྱིན་མ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: They reared young Dharmadinnā on milk, yogurt, butter, ghee, and milk solids,

source: དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་དེས་ཕ་མ་གཉིས་ལ་གསོལ་ཏེ།
en: and when she grew up she found faith in the doctrine of the Blessed One.

source: དུས་དུས་སུ་དགེ་སློང་རྣམས་དང་དགེ་སློང་མ་རྣམས་བཤོས་གསོལ་ནས་དེ་རྣམས་ཀྱི་མདུན་དུ་འདུག་སྟེ་ཆོས་ཉན་པར་བྱེད་དོ། །
en: From time to time she asked for her parents’ permission to offer food to the monks and nuns and to sit in front of them to listen to the Dharma.

source: དེ་ནས་དེས་ཆོས་ཐོས་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་ནས།
en: After hearing the Dharma, she went for refuge and took the fundamental precepts,

source: དེ་ཁྱིམ་ན་གནས་བཞིན་དུ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་རྫུ་འཕྲུལ་ཡང་བསྒྲུབས་སོ། །
en: and while still living at home she manifested the resultant state of non-return and even began to perform miracles.

source: དེས་བདེན་པ་མཐོང་ནས་ཕ་མ་གཉིས་ལ་སྨྲས་པ།
en: Having seen the truths, she asked for her parents’ permission saying,

source: ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ། བུ་མོ་ཁྱོད་མ་སྐྱེས་པའི་སྔ་རོལ་ནས། བདག་ཅག་གཉིས་ཀྱིས་ཁྱིམ་ཐབ་ལ་བྱིན་ཟིན་གྱིས་བདག་ཅག་གཉིས་ཀྱིས་གནང་བར་བྱར་མི་རུང་ངོ་། །
en: “My child, we cannot allow that,” her parents said, “for we betrothed you to a family before you were born.”

source: བུ་མོ་དེས་སྨྲས་པ།
en: Their daughter said,

source: བདག་ནི་འདོད་པ་རྣམས་དོན་དུ་གཉེར་བ་མ་ལགས་ན། བདག་ལ་ཁྱིམ་ཐབ་ཅི་འཚལ།
en: “If I have no interest in objects of desire, what need do I have for a spouse?”

source: ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ། བདག་ཅག་གཉིས་ཀྱིས་ཁྱོད་ལ་གནང་བར་བྱར་མི་རུང་གིས་འོན་ཀྱང་ཁྱོད་ཉིད་ལས་བརྟེན་ཏེ།
en: “We cannot give you permission ourselves, but it is up to you,” replied her parents.

source: བདག་ཅག་གཉིས་ཀྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲང་བར་བྱའོ། །
en: “We will invite the Buddha and the rest of the saṅgha of monks for a meal.

source: རི་དགས་འཛིན་ལ་ཡང་བཟླུགས་ལ་ཁྱོད་བདག་ཉིད་ཀྱིས་ཁྱིམ་ཐབ་ལ་གསོལ་ཏེ་རབ་ཏུ་འབྱུང་བར་གྱིས་ཤིག་ཅེས་བྱས་ནས།
en: You can ask Mṛgāra and your betrothed for permission then, and go forth.”

source: ཁྱིམ་བདག་བྱིན་པས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ནས།
en: The householder Dinna extended an invitation to the Buddha and the rest of the saṅgha of monks.

source: དེ་ཉིད་ཀྱི་མཚན་མོ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་བཤམས་ཏེ་ནང་པར་སྔར་ལངས་ནས་གདན་བཤམས་ཏེ་ཆུ་ར་བཀང་སྟེ་བཞག་ནས།
en: He prepared many good, wholesome foods that night, and in the morning he rose, prepared seats, filled the water pots, and set them out.

source: བཅོམ་ལྡན་འདས་ལ་ཕྲིན་གྱིས་གདུགས་ཚོད་བསྐུལ་བ། བཙུན་པ་གདུགས་ཚོད་ལ་བབ་སྟེ་བཤོས་གསོལ་ལགས་ན།
en: Then he sent a message to the Blessed One reminding him it was time for the midday meal: “Lord, the midday meal is upon us.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ་ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཞབས་འབྲིང་བྱས་ཏེ་དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས།
en: In the morning the Blessed One donned his lower garment and Dharma robes, and, carrying his alms bowl, he set out, encircled by a group of monks and preceded by the saṅgha of the monks.

source: ཁྱིམ་བདག་བྱིན་པའི་བཀད་ས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: He arrived at the householder Dinna’s reception room, where he took his place on the seat prepared for him.

source: དེ་ནས་ཁྱིམ་བདག་བྱིན་པས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས།
en: Once the householder knew that the Buddha and the rest of the saṅgha of monks were comfortably seated,

source: དེ་ནས་བཅོམ་ལྡན་འདས་བཤོས་གསོལ་ཟིན་ཏེ་གསང་སྡེར་ནི་གྱུ་ཕྱག་ནི་བཅབས་པར་རིག་ནས་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: After contenting them by his own hand with many different kinds of good, wholesome food, proffering all that they wished, once he knew that the Blessed One had finished eating and his bowl had been taken away and his hands washed, he sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་དེས་བུ་མོ་ཆོས་བྱིན་མ་རབ་ཏུ་འབྱུང་བར་འདོད་པ་ལས་བཟློག་མ་ནུས་ནས་ཁྱིམ་བདག་རི་དགས་འཛིན་ལ་སྦྲན་ཏེ་ཁྱོད་ཉིད་འདིར་ཤོག་ལ་ཟློག་ཤིག་ཅེས་བྱས་སོ། །
en: Since he was unable himself to prevent young Dharmadinnā from fulfilling her wish go forth, he sent word to the householder Mṛgāra, asking him to please come and prevent it.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རི་དགས་འཛིན་གཡོག་འཁོར་དང་བཅས་པ་ལྷགས་ནས་ཁྱིམ་བདག་བྱིན་པའི་ཁྱིམ་ཕྱི་བསྐོར་ཏེ་འཁོད་དོ། །
en: As soon as he heard this, Mṛgāra came with his servants and surrounded the home of the householder Dinna.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་བྱིན་པ་གཡོག་འཁོར་དང་བཅས་པ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས། གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: After the Blessed One had instructed, encouraged, inspired, and delighted the householder Dinna and the people of his house with a Dharma teaching, he rose from his seat and departed.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གཤེགས་ནས་དགེ་སློང་མའི་དགེ་འདུན་ཡང་དོང་ངོ་། །
en: After the Buddha and the saṅgha of monks had departed, the saṅgha of the nuns also departed, and young Dharmadinnā went with them.

source: བུ་མོ་ཆོས་བྱིན་མ་ཡང་དེ་དག་དང་ཐབས་ཅིག་ཏུ་སོང་ངོ་། །ཁྱེའུ་ས་ག་དང་རི་དགས་འཛིན་གཡོག་འཁོར་དང་བཅས་པས་ཀྱང་བུ་མོ་ཆོས་བྱིན་མ་ཁྱིམ་དེ་ནས་བྱུང་བ་མཐོང་ངོ་། །
en: When young Viśākha and Mṛgāra and his retinue spotted young Dharmadinnā leaving the house, they cried out,

source: མཐོང་ནས་ཀྱང་ཁྱེའུ་ས་གས་བུ་མོ་ཆོས་བྱིན་མ་བཟུང་ཞེས་བྱས་ན།
en: “Young Viśākha, grab the girl, Dharmadinnā!”

source: དེ་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ནས་འབར་བ་དང་ལམ་མེར་འདུག་པ་དང་ཆར་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ཏེ།
en: At that moment she rose up into the sky and performed a miraculous display of fire and light, rain and lightning.

source: དེ་མཐོང་ནས་ཁྱེའུ་ས་གས་བསམས་པ།
en: As soon as young Viśākha saw this, he thought,

source: འདིས་ཆོས་འདི་ལྟ་བུ་ཐོབ་པ་ལས་ན་འདི་བདག་དང་ལྷན་ཅིག་ཏུ་འདོད་པ་རྣམས་ལོངས་སྤྱོད་པར་ག་ལ་འགྱུར་སྙམ་མོ། །
en: “How could she possibly engage in sexual relations with me now that she has attained such great virtues?”

source: སོ་སོའི་སྐྱེ་བོ་ནི་རྫུ་འཕྲུལ་གྱིས་མྱུར་དུ་དད་པར་འགྱུར་ཏེ། དེ་མཐོང་མ་ཐག་ཏུ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: Ordinary people are quickly brought to faith through miracles, so when Mṛgāra’s retinue saw all this, they threw themselves at Dharmadinnā’s feet, saying,

source: བདག་ཅག་ཉེས་པར་སྤྱོད་པའི་འདམ་དུ་བྱིང་བ་ལས་ལག་ནས་དྲང་བར་གསོལ་ཞེས་བྱས་སོ། །
en: We’re mired in misdeeds! Please reach down and lift us up!”

source: དེ་ནས་དེ་ནམ་མཁའ་ལས་བབས་ནས། ཁྱེའུ་ས་གས་ཀྱང་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་བཟོད་པ་གསོལ་ནས་སྨྲས་པ།
en: She descended and young Viśākha touched his head to her feet and asked her forgiveness, saying,

source: བདག་གིས་ཁྱོད་དེ་བཞིན་དུ་གནང་ངོ་། །
en: “Of course you have my consent to go forth.

source: ཡོ་བྱད་ཐམས་ཅད་ཀྱང་སྦྱར་བར་བྱ་སྟེ་ཁྱོད་ལ་ཅི་དགོས་པ་དེ་དག་ཐམས་ཅད་བདག་གིས་སྦྱིན་ནོ་ཞེས་བྱས་ནས།
en: I shall provide for all your needs. Whatever your needs, I shall provide for them all.”

source: ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: With this he sat before her to listen to the Dharma.

source: དེ་ནས་ཆོས་བྱིན་མས་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་བྱས་ནས་སོང་ངོ་། །
en: After Dharmadinnā had instructed, encouraged, inspired, and delighted them with a Dharma teaching, she departed.

source: དེ་ནས་དགེ་སློང་མའི་གཙུག་ལག་ཁང་དུ་སོང་སྟེ།
en: She proceeded to the nunnery,

source: རབ་ཏུ་བྱུང་ནས་དགེ་སློང་མ་རྣམས་ཀྱིས་དེ་ལ་དགེ་ཚུལ་མའི་བསླབ་པའི་གཞི་རྣམས་ཀྱང་ཕོག །
en: went forth, and the nuns conferred on her the precepts for female novices.

source: ཆོས་དྲུག་གི་བསླབ་པའི་སྡོམ་པ་ཡང་ཕོག་ནས་དེ་གང་གི་ཚེ་ལོ་གཉིས་ཀྱི་བར་དུ་ཆོས་དྲུག་ལ་བསླབས་ནས་བསྙེན་པར་རྫོགས་པར་འདོད་པ་དེའི་ཚེ།
en: Having been conferred vows for the precepts of the six factors, she practiced them for two years, at which time she wished to receive full ordination.

source: དགེ་སློང་མ་རྣམས་ཀྱིས་དེ་ལ་ཚངས་པར་སྤྱོད་པའི་གནས་ཀྱི་སྡོམ་པ་ཕོག་སྟེབསྙེན་པར་རྫོགས་པར་བྱ་བའི་ཕྱིར་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཁྲིད་དོ། །
en: The nuns thus conferred on her the vows of the holy life and prepared to lead her to the garden of Prince Jeta for full ordination.

source: དེ་ཡང་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཁ་དོག་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཡུལ་ན་བཟང་བ་བྱད་གཟུགས་དཔེ་མེད་པ་ཞིག་སྟེ།
en: Dharmadinnā was well proportioned, pleasing to the eye, and beautiful, with an incomparably splendid complexion and an unmatched figure—the best in the land.

source: བཙས་མ་ཐག་ཏུ་སྐྱེ་བོ་མང་པོས་བསླངས་ན་ཡང་ཁྱིམ་བདག་བྱིན་པས་སྔོན་གཞན་ལ་བྱིན་ཟིན་པའི་ཕྱིར་སུ་ལ་ཡང་མ་བྱིན་ནོ། །
en: As soon as she was born men had started asking for her hand, but since the householder Dinna had already promised her to someone, he would not give her to anyone else.

source: དེ་གང་གི་ཚེ་རབ་ཏུ་བྱུང་བ་དེའི་ཚེ་གཞན་དག་གི་སེམས་སྐྱེས་པ། འདི་ཁྱིམ་ན་གནས་པའི་ཚེ་ནི་བདག་ཅག་གིས་མ་ཐོབ་ན་
en: When she had gone forth, those men thought, “While she was living at home we could not have her.

source: ད་ནི་འདི་རབ་ཏུ་བྱུང་ཟིན་གྱིས། བདག་ཅག་གིས་ཅི་དགའ་མགུར་བྱར་ཡོད་དོ་སྙམ་ནས་
en: But now that she has left, we can do as we please.

source: བསྐོར་བར་ཆད་དེཐབས་ཇི་ལྟར་བྱས་ན་འདི་བདག་ཅག་གིས་དབྲོག་ནུས་པར་གྱུར་སྙམ་པ་དང་།
en: They then began to consider how they might trap her and take her by force.

source: ཁ་ཅིག་སོང་སྟེ་དགེ་སློང་མ་རྣམས་ལ་སྦྲན་ནས་དགེ་སློང་མ་རྣམས་ཀྱིས་བསམས་པ།
en: Someone went and alerted the nuns, and they thought,

source: ད་ནི་འདི་བདག་ཅག་གིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཁྲིད་དེ་ བསྙེན་པར་རྫོགས་པར་བྱེད་ཀྱང་མི་ནུས་ལ།
en: “We can no longer bring her to the garden of Prince Jeta for full ordination,

source: དགེ་སློང་མའི་གཙུག་ལག་ཁང་འདིར་བཞག་པར་མི་ནུས་སོ་སྙམ་སྟེ་
en: nor can we keep her at the nunnery.”

source: ཕའི་ཁྱིམ་དུ་ཁྲིད་ནས་དེར་བཞག་གོ །
en: So they brought her back to her parents’ house, and there she stayed.

source: དེ་ནས་དགེ་སློང་མ་རྣམས་ཀྱིས་དེའི་གཏམ་རྒྱས་པར་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏེ།
en: After that the nuns related her story in detail to the Blessed One, and asked,

source: བཙུན་པ་བདག་ཅག་གིས་དགེ་སློང་མ་ཆོས་བྱིན་མ་ཇི་ལྟར་བསྙེན་པར་རྫོགས་པར་བགྱི།
en: “Lord, how can we complete the nun Dharmadinnā’s ordination?”

source: འོ་ན་དགེ་སློང་མ་ཆོས་བྱིན་མ་ཕྲིན་གྱིས་བསྙེན་པར་རྫོགས་པར་གནང་གིས།
en: “In a case like this, it is permissible for the nun Dharmadinnā to be ordained by message.

source: ཕྱིན་ཅད་གཞན་ཞིག་ཕྱི་རོལ་དུ་འབྱུང་བ་ལ། འདི་ཁོ་ན་དང་འདྲ་བའི་ཉེས་དམིགས་འབྱུང་བར་འགྱུར་ནདེ་ཡང་ཕྲིན་གྱིས་བསྙེན་པར་རྫོགས་པར་གྱིས་ཤིག་ཅེས་བཀའ་སྩལ་ནས།
en: If one day other persons like her venture outside and similar troubles arise, they too should be ordained by message.”

source: དེ་ཐོས་མ་ཐག་ཏུ་དགེ་སློང་མ་རྣམས་ཀྱིས་དེ་ཕྲིན་གྱིས་བསྙེན་པར་རྫོགས་པར་བྱས་ཏེ། གཞུང་ལས་ཇི་སྐད་འབྱུང་བ་བཞིན་དུ་རྒྱས་པར་བརྗོད་པར་བྱའོ། །
en: As soon as the nuns heard this, they conferred full ordination on Dharmadinnā by message and had her recite in exactly the way given in the scriptures.

source: དེ་ནས་ཕྲིན་གྱིས་བཟླུགས་པའི་དགེ་སློང་མ་ཆོས་བྱིན་མའི་ཐད་དུ་སོང་ནས་བསྒོ་བ།
en: Then the nuns who had sent the message came to see the nun Dharmadinnā and informed her,

source: ཆོས་བྱིན་མ་ཁྱོད་བསྙེན་པར་རྫོགས་ཟིན་གྱིས་བག་ཡོད་པར་ནན་ཏན་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: “Dharmadinnā, you have received full ordination. Be conscientious and diligent.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཆོས་བྱིན་མས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: As soon as she heard this, Dharmadinnā cast away all afflictive emotions and manifested arhatship.

source: དེ་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས། གསེར་དང་བོང་བར་མཉམ་པ་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ་ཙན་དན་སྦངས་པ་ལྟ་བུར་བསིལ་བར་གྱུར་པ་རིག་པས་སྒོ་ངའི་སྦུབས་བཅོམ་པ་རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་
en: As an arhat, free from the attachments of the three realms, her mind regarded gold no differently than filth, and the palms of her hands as like space itself. She became cool like wet sandalwood. Her insight crushed ignorance like an eggshell. She achieved the insights, superknowledges, and discriminations.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: She had no regard for worldly profit, passion, or acclaim. She became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: བཙུན་པ་ཆོས་བྱིན་མས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ།
en: “What action did Dharmadinnā take that ripened into her birth into a family of great means, prosperity, and wealth;

source: བཅོམ་ལྡན་འདས་ཀྱང་འདིས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས།
en: that she pleased and did not displease the Blessed One;

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ནས་འདི་ཁོ་ན་ལས་བརྟེན་ཏེ།
en: that, going forth in the doctrine of the Blessed One, she cast away all afflictive emotions and manifested arhatship;

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་མ་རྣམས་ལ་ཕྲིན་གྱིས་བསྙེན་པར་རྫོགས་པར་གནང་བར་མཛད་ལགས།
en: and that she alone was instrumental in the Blessed One permitting the full ordination of nuns by message?”
